alta-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: alta-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: alta-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  alta-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1280,559)
      - go(http://127.0.0.1:8000/cuota/listaCuota)
      - clickByXPath((//a[contains(text(),'Eliminar')])[4])

  alta-Http:
    headers:
      sec-ch-ua-platform: '"Windows"'
      User-Agent: >-
        Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
        like Gecko) Chrome/130.0.0.0 Safari/537.36
      sec-ch-ua: '"Chromium";v="130", "Google Chrome";v="130", "Not?A_Brand";v="99"'
      sec-ch-ua-mobile: '?0'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: >-
              https://translate.googleapis.com/element/log?format=json&hasfast=true&authuser=0
            method: POST
            label: >-
              https://translate.googleapis.com/element/log?format=json&hasfast=true&authuser=0
            headers:
              Content-Encoding: gzip
              Content-Type: application/binary
              X-Goog-AuthUser: '0'
              Accept: '*/*'
            body:
              "\x1F\x8B\b\0\0\0\0\0\0\níTÁnÛ0\fý\x95\x81gÙ!%Å\x92r\x19ºÔé­\x97mØA\x12\f\x0F1R\x01®\\$j7ôë\a5Îê®-º\x05»´¨\f\x10": ''
              "MR\x94õÞ³\x96X¼îû¿6ö© t\x11Æ·/uÃ\x91K\"Â1d­\NåÅv¸\f×\x97À\x80\x04\x82g\x16Î\x86aÓw\x1Fî¾t\x93øù\x90>\x9E4\x9F¶m\\\x03\x03cÀ{\x86\f¾\N¸\x1E~ìr\"\x96X\"0ø© `°/-±¬\x14\x17%\x91Ê]$Ãýã½g¤\x151k\x81\x94 É\x8DàFÊÃpÏ\x1Axò\_oÞ8èbñõ³{é÷¼\x9BÇÌ æ uM\x1F¾;`\x0EêÊ\x9CêZ\x89bY\x9B\x93B®¸(\x8C<Õ\NZI¤åj©d­\x1D0ëà\"¥«ÅlF\\ed\x97´Ð\x88x¸\x02ë gù\x91ydæ\x15æå§[;\x88íMØ´)\fñnóÜrF%\x8D¥þ¾\x81\x19«\x8FöüT\bHÌ\x1Fd\x91T£OX\x99\x8A\x11\x8A\x83õ>Ï\x99¶mÜõmê\x16Wí¦kú¡]7ihB\f)´}¸íÖyä?zí}Á¹\x9E\x1EÝú¼¦H}¤e\x84\x1Añù £,8÷²0×üeYpÐíþ\e": "2Ý^\v×Þ¥áxiàÇHÃCló\x7FÄ6÷\x9EýÆ¶0Rrð¿\0y§'Kî\a\0\0"
          - url: 'http://127.0.0.1:8000/eliminarCuota/4/'
            method: GET
            label: 'http://127.0.0.1:8000/eliminarCuota/4/'
            think-time: 677ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: >-
                text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7